# ThermalExpansionCoefficient Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..ThermalExpansionCoefficient Property
StructuralAsset Class See Also
---
The thermal expansion coefficient of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ ThermalExpansionCoefficient { get; set; }
```

Visual Basic
---
```text
Public Property ThermalExpansionCoefficient As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ ThermalExpansionCoefficient {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
This property cannot be used to set the thermal expansion coefficient for wood-based and isotropic materials. For such assets, use setThermalExpansionCoefficient instead. The value is in inverse Kelvin (1/K).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace